{
  "Index": {
    "hello": "Hello!",
    "my_name": "My name is Viet Anh",
    "i_am_a_developer": "I'm a developer",
    "i_am_a_ui/ux_designer": "I'm a designer",
    "resume_content": "I am a developer with 3 years of experience in creating a complete mobile apps and websites. In addition to the ability to write code, I also have UI/UX design skills for web systems and apps. This skill has helped me supplement my frontend knowledge, thereby improving my work efficiency and helping the company a lot. I am eager to work in a modern environment where I can contribute with my burning passion for technology.",
    "hire_me": "Hire Me",
    "download_cv": "Download CV"
  },
  "Skill": {
    "flutter": "Clean architecture, Bloc, GetX, Provider, Map, Biometrics, Google ads, (Android/IOS)",
    "react": "Next.js, Tailwind, MUI, CEO, HTML/CSS, Bootstrap, Shadcn-ui, Dark-mode, multi language",
    "figma": "Knowledge about UI/UX, Proficient in figma, Web, Mobile App",
    "node": "Nest.js, Socket, API, Crawl Data, Authenticate, Swagger, Schedule",
    "vue": "I can use Vue.js at an intermediate level, Element-plus, VueX",
    "database": "MySQL, Mongo db, Postgres, SQL Server",
    "docker": "I can use docker to run the project, deploy, CI/CD with Gitlab-runner, use Nginx to public server",
    "ruby": "I can create a basic api, write swagger file"
  },
  "Experience": {
    "time_1": "March 2024 - Present",
    "time_2": "September 2022 - March 2024",
    "time_3": "May 2022 - September 2022",
    "project_name_1-1": "Labor management in Hau Giang province - (Vietnamese client)",
    "project_name_1-2": "Medical record management - (Vietnamese client)",
    "project_name_2-1": "Diary management project - (Japanese client)",
    "project_name_2-2": "Banana disease analysis app - (European client)",
    "project_name_2-3": "Mother and baby health care project - (Japanese client)",
    "project_name_2-4": "Zoom Meeting Management Website - (Japanese client)",
    "project_name_2-5": "Asset management project - (Vietnamese client)",
    "project_name_3-1": "Web and Mobile App development for incident management project",
    "team_menbers": "Team Members",
    "technologies": "Technologies",
    "responsibility": "Responsibility",
    "design_figma_on_platform": "Design figma on platform",
    "responsibility_1-1": "Receiving requests from the BA to design the user interface, then presenting the interface to the client for feedback and making adjustments if necessary.",
    "responsibility_1-2": "Designed user interfaces for a mobile application, ensuring a user-friendly experience. Translated Figma designs into functional interfaces using Flutter. Integrated APIs to implement core features of the application.",
    "responsibility_2-1": "Sub-lead managing progress, code review, task allocation, and providing technical support. Participated in writing APIs and developing the UI on Figma. Handle the video playback.",
    "responsibility_2-2": "I participate in improving the application, integrate Google Map into searching for diseased crop areas, process analytical data on UI. I design a new UI with Figma to upgrade the UI for the app.",
    "responsibility_2-3": "I build the UI on the Figma design and integrate API.",
    "responsibility_2-4": "I participate in writing API using Nest.js framework and configuring mysql into source code.",
    "responsibility_2-5": "I build the UI on the Figma design and integrate API.",
    "responsibility_3-1": "I build the interface based on the Figma design and integrate API."
  },
  "Projects": {
    "name_1": "Mini Pixel game",
    "name_2": "Medical app design",
    "name_3": "Music listening app",
    "name_4": "Manhwa page design",
    "name_5": "Kruskal Algorithm Graph editor webpage",
    "name_6": "Tetris game",
    "detail_1": "A simple game written in Java. You can control a character to defeat enemies.",
    "detail_2": "Design a healthcare application for the Hậu Giang Provincial Department of Health.",
    "detail_3": "An application that allows users to search for and listen to movie soundtracks.",
    "detail_4": "A personal project about designing a website for reading manhwa and news about popular anime.",
    "detail_5": "A website that allows users to draw graphs with vertices and edges. They can run Kruskal's algorithm to find the minimum spanning tree on the graph.",
    "detail_6": "A simple block-stacking game developed using C/C++ for the console.",
    "button_see_more": "See more..."
  },
  "Contact": {
    "name": "Name",
    "email": "Email",
    "message": "Message",
    "send": "Send",
    "message_sent": "Thank you! Your message has been sent.",
    "message_note_form": "You can open this form to send message for me.",
    "button_close": "Close form",
    "button_open": "Open form"
  }
}
